import json
import requests
import time
def get_mercator(addr):
    url= 'http://api.map.baidu.com/geocoder/v2/?address=%s&output=json&ak=kTWetyXuPLx38KRbCHxswZRkFKPLtw0H&callback=showLocation'%(addr)
    response = requests.get(url)
    return response
def getLngAndLat(addrs):
    result = {}
    for addr in addrs:
        response=get_mercator(addr)
        #print(response.text)
        lngAndLat = []
        try:
            jsonRe = json.loads(response.text.split("showLocation&&showLocation(")[1].strip(")"))["result"]["location"]
            lngAndLat.append(jsonRe["lng"])
            lngAndLat.append(jsonRe["lat"])
            result[addr] = lngAndLat
        except Exception:
            result[addr] = lngAndLat
        time.sleep(1)

    return result

if __name__=="__main__":
#     addrs = ['三亚', '三明', '三门峡', '上海', '上饶', '东莞', '东营', '中山', '临汾', '临沂', '丹东', '丽水', '乌兰察布', '乌鲁木齐', '乐山', '九江', '云浮', '五指山', '亳州', '伊犁', '佛山', '佳木斯', '俄罗斯联邦', '保定',\
# '信阳', '儋州', '克孜勒苏', '克拉玛依', '六安', '兰州', '兴平', '其他', '内江', '包头', '北京', '北海', '十堰', '南京', '南充', '南宁', '南平', '南昌', '南通', '南阳', '印度', '印度尼西亚', '厦门', '台州', '合肥',\
#  '吉安', '吉林市', '吕梁', '周口', '呼伦贝尔', '呼和浩特', '和田', '咸宁', '咸阳', '哈尔滨', '唐山', '商丘', '喀什', '嘉兴', '嘉峪关', '四平', '国外', '大庆', '大连', '天水', '天津', '太仓市', '太原', '威海', '娄\
# 底', '孝感', '宁德', '宁波', '安庆', '安康', '安阳', '安顺', '宜宾', '宜昌', '宜春', '宝鸡', '宣城', '宿迁', '岳阳', '峨眉', '巴中', '巴彦淖尔', '常州', '常德', '常熟', '平顶山', '广元', '广安', '广州', '廊坊', '\
# 延安', '延边', '开封', '张家口', '张家港', '张家界', '徐州', '德国', '德州', '德阳', '怀化', '惠州', '成都', '扬州', '承德', '抚顺', '拉萨', '揭阳', '新乡', '新余', '新加坡', '方家山', '无锡', '日喀则', '日本', '\
# 日照', '昆山', '昆明', '晋中', '晋城', '普洱', '景德镇', '曲靖', '朝阳', '杭州', '松原', '枣庄', '柬埔寨', '柳州', '株洲', '桂林', '梅州', '榆林', '武汉', '毕节', '永州', '汕头', '汕尾', '江门', '池州', '沈阳', '\
# 沧州', '河源', '泉州', '泰安', '泰州', '泸州', '洛阳', '济南', '济宁', '济源', '海东', '海口', '淄博', '淮北', '淮南', '淮安', '深圳', '清远', '温州', '渭南', '湖州', '湘潭', '湛江', '滁州', '滨州', '漯河', '漳州'\
# , '潍坊', '潜江', '潮州', '澄迈', '澳门', '濮阳', '烟台', '焦作', '玉溪', '珠海', '白俄罗斯', '白银', '百色', '益阳', '盐城', '盘锦', '眉山', '石家庄', '福州', '秦皇岛', '简阳', '绍兴', '绵阳', '聊城', '肇庆', '自\
# 贡', '舟山', '芜湖', '苏州', '茂名', '荆州', '荆门', '莆田', '莱芜', '菏泽', '菲律宾', '萍乡', '营口', '蚌埠', '衡水', '衡阳', '衢州', '襄阳', '西双版纳', '西咸新区', '西宁', '西安', '西昌', '许昌', '贵阳', '贺州'\
# , '资阳', '赣州', '赤峰', '辽阳', '达州', '运城', '连云港', '通化', '通辽', '遂宁', '遵义', '邢台', '邯郸', '邵阳', '郑州', '郴州', '鄂尔多斯', '鄂州', '酒泉', '重庆', '金华', '钦州', '铁岭', '铜陵', '银川', '锦州\
# ', '镇江', '长春', '长沙', '长治', '阜阳', '防城港', '阳江', '阳泉', '阿坝', '随州', '雅安', '青岛', '鞍山', '韶关', '马鞍山', '驻马店', '鹤壁', '鹰潭', '黄石', '黔东南', '黔南', '龙岩']
    addrs=["湖南省石门县"]
    print(getLngAndLat(addrs))